FemDesign.Results.ShellStress
FemDesign "Shells, Stresses" result

FemDesign.Results.ShellStress.Id
Shell name identifier

FemDesign.Results.ShellStress.ElementId
Finite element id

FemDesign.Results.ShellStress.NodeId
Finite element node id

FemDesign.Results.ShellStress.SigmaX
Normal Stress in the local X direction

FemDesign.Results.ShellStress.SigmaY
Normal Stress in in the local Y direction

FemDesign.Results.ShellStress.TauXY
Tangential Stress in XY plane

FemDesign.Results.ShellStress.TauXZ
Tangential Stress in XZ plane

FemDesign.Results.ShellStress.TauYZ
Tangential Stress in YZ plane

FemDesign.Results.ShellStress.SigmaVM
VonMises Stress [N/mm2]

FemDesign.Results.ShellStress.Sigma1
Principal Stress Value - First direction

FemDesign.Results.ShellStress.Sigma2
Principal Stress Value - Second direction

FemDesign.Results.ShellStress.Alpha
Angle between the local X axis and the direction
of the principle stress Sigma1 [rad]

FemDesign.Results.ShellStress.Side
Positional Result for Shell Stress
Top, Membrane, Bottom

FemDesign.Results.ShellStress.CaseIdentifier
Load case or combination name

FemDesign.Results.ShellStress.DeconstructShellStress(System.Collections.Generic.List{FemDesign.Results.ShellStress},System.String)
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.